total_station_ver1_list = ['Тахеометр электронный CX-106', 'Тахеометр электронный FX-105',
                           'Тахеометр электронный FX-105L', 'Тахеометр электронный CX-105',
                           'Тахеометр электронный CX-105L', 'Тахеометр электронный FX-103',
                           'Тахеометр электронный FX-103L', 'Тахеометр электронный CX-103',
                           'Тахеометр электронный FX-102', 'Тахеометр электронный FX-102L',
                           'Тахеометр электронный CX-102', 'Тахеометр электронный CX-102L',
                           'Тахеометр электронный FX-101', 'Тахеометр электронный FX-101L',
                           'Тахеометр электронный ES-107', 'Тахеометр электронный OS-105',
                           'Тахеометр электронный OS-105L', 'Тахеометр электронный ES-105',
                           'Тахеометр электронный ES-65', 'Тахеометр электронный ES-105L',
                           'Тахеометр электронный OS-103', 'Тахеометр электронный OS-103L',
                           'Тахеометр электронный ES-103', 'Тахеометр электронный OS-102',
                           'Тахеометр электронный OS-102L', 'Тахеометр электронный ES-102',
                           'Тахеометр электронный ES-62', 'Тахеометр электронный ES-102L',
                           'Тахеометр электронный OS-101', 'Тахеометр электронный OS-101L']

measuring_tape_list = ['Рулетки UM3M', 'Рулетки UM5M', 'Рулетки BT8M', 'Рулетки CC10M', 'Рулетки TR20/5',
                       'Рулетки CC20M', 'Рулетки TR30/5', 'Рулетки TR50/5', 'Рулетки TS50/2', 'Рулетки YC50/5',
                       'Рулетка UM3M', 'Рулетка UM5M', 'Рулетка BT8M', 'Рулетка CC10M', 'Рулетка TR20/5',
                       'Рулетка CC20M', 'Рулетка TR30/5', 'Рулетка TR50/5', 'Рулетка TS50/2', 'Рулетка YC50/5'
                       ]

staff_list = ['Рейка шашечная VEGA TS3M', 'Рейка шашечная VEGA TS4M', 'Рейка шашечная VEGA TS5M']

optical_level_list = ['Нивелир VEGA L32C', 'Нивелир VEGA L30', 'Нивелир VEGA L20', 'Нивелир VEGA L24', 'Нивелир B30A',
                      'Нивелир AT-B3A', 'Нивелир B40A', 'Нивелир AT-B4A']
