metr_par03_m = 'диапазон измерений 0-3 м, КТ 3'
metr_par05_m = 'диапазон измерений 0-5 м, КТ 3'
metr_par08_m = 'диапазон измерений 0-8 м, КТ 3'
metr_par10_m = 'диапазон измерений 0-10 м, КТ 3'
metr_par15_m = 'диапазон измерений 0-15 м, КТ 3'
metr_par20_m = 'диапазон измерений 0-20 м, КТ 3'
metr_par30_m = 'диапазон измерений 0-30 м, КТ 3'
metr_par50_m = 'диапазон измерений 0-50 м, КТ 3'
metr_par100_m = 'диапазон измерений 0-100 м, КТ 3'
metr_par_staff = 'Допускаемое отклонение ±1,0 мм'

dict_dopuska_measuring_tape_staff = {
    'МИ 1780-87': {'Рулетка UM3M': ('Ленты образцовые и рулетки металлические измерительные. Методика поверки',
                                    'п. 4.1', 'п. 4.2', metr_par03_m, '0-1, м', 0.4, '0-2, м', 0.6, '0-3, м', 0.8,
                                    '------', 0, '------', 0, '------', 0, '------', 0, '------', 0,
                                    '------', 0, '------', 0),
                   'Рулетка UM5M': ('Ленты образцовые и рулетки металлические измерительные. Методика поверки',
                                    'п. 4.1', 'п. 4.2', metr_par05_m, '0-1, м', 0.4, '0-2, м', 0.6, '0-3, м', 0.8,
                                    '0-4, м', 1.0, '0-5, м', 1.2, '------', 0, '------', 0, '------', 0,
                                    '------', 0, '------', 0),
                   'Рулетка TL5M': ('Ленты образцовые и рулетки металлические измерительные. Методика поверки',
                                    'п. 4.1', 'п. 4.2', metr_par05_m, '0-1, м', 0.4, '0-2, м', 0.6, '0-3, м', 0.8,
                                    '0-4, м', 1.0, '0-5, м', 1.2, '------', 0, '------', 0, '------', 0,
                                    '------', 0, '------', 0),
                   'Рулетка BT8M': ('Ленты образцовые и рулетки металлические измерительные. Методика поверки',
                                    'п. 4.1', 'п. 4.2', metr_par08_m, '0-1, м', 0.4, '0-2, м', 0.6, '0-3, м', 0.8,
                                    '0-4, м', 1.0, '0-5, м', 1.2, '0-6, м', 1.4, '0-7, м', 1.6, '0-8, м', 1.8,
                                    '------', 0, '------', 0),
                   'Рулетка CC10M': ('Ленты образцовые и рулетки металлические измерительные. Методика поверки',
                                     'п. 4.1', 'п. 4.2', metr_par10_m, '0-1, м', 0.4, '0-2, м', 0.6, '0-3, м', 0.8,
                                     '0-4, м', 1.0, '0-5, м', 1.2, '0-6, м', 1.4, '0-7, м', 1.6, '0-8, м', 1.8,
                                     '0-9, м', 2.0, '0-10, м', 2.2),
                   'Рулетка TR20/5': ('Ленты образцовые и рулетки металлические измерительные. Методика поверки',
                                      'п. 4.1', 'п. 4.2', metr_par20_m, '0-1, м', 0.4, '0-2, м', 0.6, '0-3, м', 0.8,
                                      '0-4, м', 1.0, '0-5, м', 1.2, '0-6, м', 1.4, '0-8, м', 1.8, '0-10, м', 2.2,
                                      '0-15, м', 3.2, '0-20, м', 4.2),
                   'Рулетка TS20/2': ('Ленты образцовые и рулетки металлические измерительные. Методика поверки',
                                      'п. 4.1', 'п. 4.2', metr_par20_m, '0-1, м', 0.4, '0-2, м', 0.6, '0-3, м', 0.8,
                                      '0-4, м', 1.0, '0-5, м', 1.2, '0-6, м', 1.4, '0-8, м', 1.8, '0-10, м', 2.2,
                                      '0-15, м', 3.2, '0-20, м', 4.2),
                   'Рулетка CC20M': ('Ленты образцовые и рулетки металлические измерительные. Методика поверки',
                                     'п. 4.1', 'п. 4.2', metr_par20_m, '0-1, м', 0.4, '0-2, м', 0.6, '0-3, м', 0.8,
                                     '0-4, м', 1.0, '0-5, м', 1.2, '0-6, м', 1.4, '0-8, м', 1.8, '0-10, м', 2.2,
                                     '0-15, м', 3.2, '0-20, м', 4.2),
                   'Рулетка TC30/5': ('Ленты образцовые и рулетки металлические измерительные. Методика поверки',
                                      'п. 4.1', 'п. 4.2', metr_par30_m, '0-1, м', 0.4, '0-2, м', 0.6, '0-3, м', 0.8,
                                      '0-4, м', 1.0, '0-5, м', 1.2, '0-10, м', 2.2, '0-15, м', 3.2, '0-20, м', 4.2,
                                      '0-25, м', 5.2, '0-30, м', 6.2),
                   'Рулетка TS30/2': ('Ленты образцовые и рулетки металлические измерительные. Методика поверки',
                                      'п. 4.1', 'п. 4.2', metr_par30_m, '0-1, м', 0.4, '0-2, м', 0.6, '0-3, м', 0.8,
                                      '0-4, м', 1.0, '0-5, м', 1.2, '0-10, м', 2.2, '0-15, м', 3.2, '0-20, м', 4.2,
                                      '0-25, м', 5.2, '0-30, м', 6.2),
                   'Рулетка TR30/5': ('Ленты образцовые и рулетки металлические измерительные. Методика поверки',
                                      'п. 4.1', 'п. 4.2', metr_par30_m, '0-1, м', 0.4, '0-2, м', 0.6, '0-3, м', 0.8,
                                      '0-4, м', 1.0, '0-5, м', 1.2, '0-10, м', 2.2, '0-15, м', 3.2, '0-20, м', 4.2,
                                      '0-25, м', 5.2, '0-30, м', 6.2),
                   'Рулетка TR50/5': ('Ленты образцовые и рулетки металлические измерительные. Методика поверки',
                                      'п. 4.1', 'п. 4.2', metr_par50_m, '0-1, м', 0.4, '0-2, м', 0.6, '0-3, м', 0.8,
                                      '0-4, м', 1.0, '0-5, м', 1.2, '0-10, м', 2.2, '0-20, м', 4.2, '0-30, м', 6.2,
                                      '0-40, м', 8.2, '0-50, м', 10.2),
                   'Рулетка TS50/2': ('Ленты образцовые и рулетки металлические измерительные. Методика поверки',
                                      'п. 4.1', 'п. 4.2', metr_par50_m, '0-1, м', 0.4, '0-2, м', 0.6, '0-3, м', 0.8,
                                      '0-4, м', 1.0, '0-5, м', 1.2, '0-10, м', 2.2, '0-20, м', 4.2, '0-30, м', 6.2,
                                      '0-40, м', 8.2, '0-50, м', 10.2),
                   'Рулетка YC50/5': ('Ленты образцовые и рулетки металлические измерительные. Методика поверки',
                                      'п. 4.1', 'п. 4.2', metr_par50_m, '0-1, м', 0.4, '0-2, м', 0.6, '0-3, м', 0.8,
                                      '0-4, м', 1.0, '0-5, м', 1.2, '0-10, м', 2.2, '0-20, м', 4.2, '0-30, м', 6.2,
                                      '0-40, м', 8.2, '0-50, м', 10.2),
                   'Рулетка PR100/5': ('Ленты образцовые и рулетки металлические измерительные. Методика поверки',
                                       'п. 4.1', 'п. 4.2', metr_par50_m, '0-10, м', 2.2, '0-20, м', 4.2,
                                       '0-30, м', 6.2, '0-40, м', 8.2, '0-50, м', 10.2, '0-60, м', 12.2,
                                       '0-70, м', 14.2, '0-80, м', 16.2, '0-90, м', 18.2, '0-100, м', 20.2),
                   },
    'МП РТ 1769-2012': {'Рейка шашечная VEGA TS3M':
                        ('Рейки нивелирные телескопические TS3M, TS4M, TS5M. Методика поверки',
                         'п. 7.1', 'п. 7.2', metr_par_staff, 7.5, 0.5, 0.5, 1.0, 0.5),
                        'Рейка шашечная VEGA TS4M':
                            ('Рейки нивелирные телескопические TS3M, TS4M, TS5M. Методика поверки',
                             'п. 7.1', 'п. 7.2', metr_par_staff, 7.5, 0.5, 0.5, 1.0, 0.5),
                        'Рейка шашечная VEGA TS5M':
                            ('Рейки нивелирные телескопические TS3M, TS4M, TS5M. Методика поверки',
                             'п. 7.1', 'п. 7.2', metr_par_staff, 7.5, 0.5, 0.5, 1.0, 0.5),
                        }
}
